In [18]:
import numpy as np
import pandas as pd
import os # for directory
import re # for expression

In [5]:
os.getcwd()

'C:\\Users\\PC 16\\Desktop\\NB\\data science'

In [8]:
df=pd.read_csv('clean.csv')
print(df)

                  #Cleaning schedule. Start 7/8/2023. Unnamed: 1  \
0   #sink_table: whether they wiped the sink or table        NaN
1   #diswasher: whether the dishwasher was full at...        NaN
2   #no_of mugs/plates: the number of mugs or plat...        NaN
3                                                  No       Name
4                                                   1        Ali
5                                                   2      Johan
6                                                   3       Daus
7                                                   4     George
8                                                   5    Amelia
9                                                   6      Ahmad
10                                                  6      Ahmad
11                                                  7        Ava
12                                                  8      Harry
13                                                  9      Cindy
14                                                 10      Ariel

           Unnamed: 2  Unnamed: 3         Unnamed: 4             Unnamed: 5
0                 NaN         NaN                NaN                    NaN
1                 NaN         NaN                NaN                    NaN
2                 NaN         NaN                NaN                    NaN
3          sink Table  dishwasher  no Of mugs/plates                   Note
4           sink only          no                  9                      -
5      sink and table        YES!                2-3      all looking GOOD!
6          sink,table         Yes                  8                    NaN
7                 NaN         NaN                  0  All of us at workshop
8      just the table         yes          around 10                    NaN
9                both          NO                  6                      -
10               both          NO                  6                      -
11  didn't need doing         no.                  4              not messy
12      just the sink          no                  3                    NaN
13       sink & table         YES                6-9    can't remember them
14         table only          no                  2                      -

In [10]:
df=pd.read_csv('clean.csv', skiprows=4, na_values=['-'])
print(df)

    No     Name         sink Table dishwasher no Of mugs/plates  \
0    1      Ali          sink only         no                 9
1    2    Johan     sink and table       YES!               2-3
2    3     Daus         sink,table        Yes                 8
3    4   George                NaN        NaN                 0
4    5  Amelia      just the table        yes         around 10
5    6    Ahmad               both         NO                 6
6    6    Ahmad               both         NO                 6
7    7      Ava  didn't need doing        no.                 4
8    8    Harry      just the sink         no                 3
9    9    Cindy       sink & table        YES               6-9
10  10    Ariel         table only         no                 2

                     Note
0                     NaN
1       all looking GOOD!
2                     NaN
3   All of us at workshop
4                     NaN
5                     NaN
6                     NaN
7               not messy
8                     NaN
9     can't remember them
10                    NaN

In [11]:
df.columns=df.columns.str.lower() #make all lowercase
print(df)

    no     name         sink table dishwasher no of mugs/plates  \
0    1      Ali          sink only         no                 9
1    2    Johan     sink and table       YES!               2-3
2    3     Daus         sink,table        Yes                 8
3    4   George                NaN        NaN                 0
4    5  Amelia      just the table        yes         around 10
5    6    Ahmad               both         NO                 6
6    6    Ahmad               both         NO                 6
7    7      Ava  didn't need doing        no.                 4
8    8    Harry      just the sink         no                 3
9    9    Cindy       sink & table        YES               6-9
10  10    Ariel         table only         no                 2

                     note
0                     NaN
1       all looking GOOD!
2                     NaN
3   All of us at workshop
4                     NaN
5                     NaN
6                     NaN
7               not messy
8                     NaN
9     can't remember them
10                    NaN

In [12]:
df=df.drop_duplicates()
print(df)

    no     name         sink table dishwasher no of mugs/plates  \
0    1      Ali          sink only         no                 9
1    2    Johan     sink and table       YES!               2-3
2    3     Daus         sink,table        Yes                 8
3    4   George                NaN        NaN                 0
4    5  Amelia      just the table        yes         around 10
5    6    Ahmad               both         NO                 6
7    7      Ava  didn't need doing        no.                 4
8    8    Harry      just the sink         no                 3
9    9    Cindy       sink & table        YES               6-9
10  10    Ariel         table only         no                 2

                     note
0                     NaN
1       all looking GOOD!
2                     NaN
3   All of us at workshop
4                     NaN
5                     NaN
7               not messy
8                     NaN
9     can't remember them
10                    NaN

In [13]:
df=df.drop_duplicates()
print(df.reset_index())  #reset or df=df.drop_duplicates().reset_index()

   index  no     name         sink table dishwasher no of mugs/plates  \
0      0   1      Ali          sink only         no                 9
1      1   2    Johan     sink and table       YES!               2-3
2      2   3     Daus         sink,table        Yes                 8
3      3   4   George                NaN        NaN                 0
4      4   5  Amelia      just the table        yes         around 10
5      5   6    Ahmad               both         NO                 6
6      7   7      Ava  didn't need doing        no.                 4
7      8   8    Harry      just the sink         no                 3
8      9   9    Cindy       sink & table        YES               6-9
9     10  10    Ariel         table only         no                 2

                    note
0                    NaN
1      all looking GOOD!
2                    NaN
3  All of us at workshop
4                    NaN
5                    NaN
6              not messy
7                    NaN
8    can't remember them
9                    NaN

In [14]:
#output in series
df['name'].str.strip()

0        Ali
1      Johan
2       Daus
3     George
4     Amelia
5      Ahmad
7        Ava
8      Harry
9      Cindy
10     Ariel
Name: name, dtype: object

In [15]:
df['name']=df['name'].str.strip() ##replacing white space in original data
print(df)

    no    name         sink table dishwasher no of mugs/plates  \
0    1     Ali          sink only         no                 9
1    2   Johan     sink and table       YES!               2-3
2    3    Daus         sink,table        Yes                 8
3    4  George                NaN        NaN                 0
4    5  Amelia     just the table        yes         around 10
5    6   Ahmad               both         NO                 6
7    7     Ava  didn't need doing        no.                 4
8    8   Harry      just the sink         no                 3
9    9   Cindy       sink & table        YES               6-9
10  10   Ariel         table only         no                 2

                     note
0                     NaN
1       all looking GOOD!
2                     NaN
3   All of us at workshop
4                     NaN
5                     NaN
7               not messy
8                     NaN
9     can't remember them
10                    NaN

In [17]:
df=df.map(lambda x:x.strip() if isinstance(x,str) else x) #remove whitespace if data is string with condition
print(df)

    no    name         sink table dishwasher no of mugs/plates  \
0    1     Ali          sink only         no                 9
1    2   Johan     sink and table       YES!               2-3
2    3    Daus         sink,table        Yes                 8
3    4  George                NaN        NaN                 0
4    5  Amelia     just the table        yes         around 10
5    6   Ahmad               both         NO                 6
7    7     Ava  didn't need doing        no.                 4
8    8   Harry      just the sink         no                 3
9    9   Cindy       sink & table        YES               6-9
10  10   Ariel         table only         no                 2

                     note
0                     NaN
1       all looking GOOD!
2                     NaN
3   All of us at workshop
4                     NaN
5                     NaN
7               not messy
8                     NaN
9     can't remember them
10                    NaN

In [20]:
#import re
df['dishwasher']=df['dishwasher'].str.replace(r'[^\w\s]','',regex=True) 
print(df)

    no    name         sink table dishwasher no of mugs/plates  \
0    1     Ali          sink only         no                 9
1    2   Johan     sink and table        YES               2-3
2    3    Daus         sink,table        Yes                 8
3    4  George                NaN        NaN                 0
4    5  Amelia     just the table        yes         around 10
5    6   Ahmad               both         NO                 6
7    7     Ava  didn't need doing         no                 4
8    8   Harry      just the sink         no                 3
9    9   Cindy       sink & table        YES               6-9
10  10   Ariel         table only         no                 2

                     note
0                     NaN
1       all looking GOOD!
2                     NaN
3   All of us at workshop
4                     NaN
5                     NaN
7               not messy
8                     NaN
9     can't remember them
10                    NaN

In [22]:
df['dishwasher']=df['dishwasher'].str.lower()

In [23]:
#remove all character in dataset
df['no of mugs/plates']=df['no of mugs/plates'].str.replace(r'[^\d-]','',regex=True)
print(df)

    no    name         sink table dishwasher no of mugs/plates  \
0    1     Ali          sink only         no                 9
1    2   Johan     sink and table        yes               2-3
2    3    Daus         sink,table        yes                 8
3    4  George                NaN        NaN                 0
4    5  Amelia     just the table        yes                10
5    6   Ahmad               both         no                 6
7    7     Ava  didn't need doing         no                 4
8    8   Harry      just the sink         no                 3
9    9   Cindy       sink & table        yes               6-9
10  10   Ariel         table only         no                 2

                     note
0                     NaN
1       all looking GOOD!
2                     NaN
3   All of us at workshop
4                     NaN
5                     NaN
7               not messy
8                     NaN
9     can't remember them
10                    NaN

In [28]:
df['sink']=df['sink table'].str.contains('sink|both')#check first true/false bfr save it to original data df[]=df[]
df['table']=df['sink table'].str.contains('table|both')
print(df)

    no    name         sink table dishwasher no of mugs/plates  \
0    1     Ali          sink only         no                 9
1    2   Johan     sink and table        yes               2-3
2    3    Daus         sink,table        yes                 8
3    4  George                NaN        NaN                 0
4    5  Amelia     just the table        yes                10
5    6   Ahmad               both         no                 6
7    7     Ava  didn't need doing         no                 4
8    8   Harry      just the sink         no                 3
9    9   Cindy       sink & table        yes               6-9
10  10   Ariel         table only         no                 2

                     note   sink  table
0                     NaN   True  False
1       all looking GOOD!   True   True
2                     NaN   True   True
3   All of us at workshop    NaN    NaN
4                     NaN  False   True
5                     NaN   True   True
7               not messy  False  False
8                     NaN   True  False
9     can't remember them   True   True
10                    NaN  False   True

In [29]:
# output in dataframe
df_reduced=df[['name','sink','table','no of mugs/plates','note']]
print(df_reduced)

      name   sink  table no of mugs/plates                   note
0      Ali   True  False                 9                    NaN
1    Johan   True   True               2-3      all looking GOOD!
2     Daus   True   True                 8                    NaN
3   George    NaN    NaN                 0  All of us at workshop
4   Amelia  False   True                10                    NaN
5    Ahmad   True   True                 6                    NaN
7      Ava  False  False                 4              not messy
8    Harry   True  False                 3                    NaN
9    Cindy   True   True               6-9    can't remember them
10   Ariel  False   True                 2                    NaN

### Hierarchical Index

In [33]:
#array
group=['G1','G1','G2','G2']
subgroup=['A','B','A','B']

#recreating hie index from array
sa_index=pd.MultiIndex.from_arrays([group,subgroup],names=['Group','Subgroup'])

np.random.seed(42)
data=pd.DataFrame(np.random.randn(4,2),columns=['Metric1', 'Metric2'],index=m_index)
print(data)

                 Metric1   Metric2
Group Subgroup
G1    A         0.496714 -0.138264
      B         0.647689  1.523030
G2    A        -0.234153 -0.234137
      B         1.579213  0.767435

In [32]:
#tuples
m_index=pd.MultiIndex.from_tuples([('G1','A'),
                                   ('G1','B'),
                                  ('G2','A'),
                                  ('G2','B')],names=['Group','Subgroup'])
                                 

np.random.seed(42)
data=pd.DataFrame(np.random.randn(4,2),columns=['Metric1', 'Metric2'],index=m_index)
print(data)

                 Metric1   Metric2
Group Subgroup
G1    A         0.496714 -0.138264
      B         0.647689  1.523030
G2    A        -0.234153 -0.234137
      B         1.579213  0.767435

In [37]:
#manually
data=pd.DataFrame({
    'Group':['G1','G1','G2','G2'],
    'Subgroup':['A','B','A','B'],
    'Metric1':[1.0,2.0,3.0,4.0],
    'Metric2':[5.0,6.0,7.0,8.0]
})

data=data.set_index(['Group','Subgroup'])
print(data)

                Metric1  Metric2
Group Subgroup
G1    A             1.0      5.0
      B             2.0      6.0
G2    A             3.0      7.0
      B             4.0      8.0

In [40]:
print(data.loc[('G1','A')]) # to see items in both G1 and A

Metric1    1.0
Metric2    5.0
Name: (G1, A), dtype: float64

In [41]:
print(data.iloc[0,:])

Metric1    1.0
Metric2    5.0
Name: (G1, A), dtype: float64

In [42]:
print(data.reset_index())

  Group Subgroup  Metric1  Metric2
0    G1        A      1.0      5.0
1    G1        B      2.0      6.0
2    G2        A      3.0      7.0
3    G2        B      4.0      8.0

### Long vs Wide

In [43]:
# Wide (each row typically represents a unique subject, and multiple columns represent different variables)
data={
    'Student':['Ali','Siti'],
    'Math_Score':[80,78],
    'Science_Score':[75,82],
    'English_Score':[89,83]
}
df_wide=pd.DataFrame(data)
print(df_wide)

  Student  Math_Score  Science_Score  English_Score
0     Ali          80             75             89
1    Siti          78             82             83

In [44]:
# Long (each subject has multiple rows, with one column representing the variable type)
data1={
    'Student':['Ali','Ali','Ali','Siti','Siti','Siti'],
    'Subject':['Math','Science','English','Math','Science','English'],
    'Score':[80,75,89,78,82,83],
}
df_long=pd.DataFrame(data1)
print(df_long)

  Student  Subject  Score
0     Ali     Math     80
1     Ali  Science     75
2     Ali  English     89
3    Siti     Math     78
4    Siti  Science     82
5    Siti  English     83

In [45]:
df_long.set_index(['Student','Subject']).unstack()

          Score
Subject English Math Science
Student
Ali          89   80      75
Siti         83   78      82

In [46]:
df_long.pivot(index='Student',columns='Subject', values='Score')

Subject  English  Math  Science
Student
Ali           89    80       75
Siti          83    78       82

In [48]:
pd.melt(df_wide,id_vars=['Student'],value_vars=['Math_Score', 'Science_Score', 'English_Score'],var_name='Subject',value_name='Score')

  Student        Subject  Score
0     Ali     Math_Score     80
1    Siti     Math_Score     78
2     Ali  Science_Score     75
3    Siti  Science_Score     82
4     Ali  English_Score     89
5    Siti  English_Score     83

In [50]:
df_wide.set_index(['Student']).stack()

Student
Ali      Math_Score       80
         Science_Score    75
         English_Score    89
Siti     Math_Score       78
         Science_Score    82
         English_Score    83
dtype: int64

In [49]:
#recreating hie to index
m_index=pd.MultiIndex.from_tuples([('G1','A'),
                                   ('G1','B'),
                                  ('G2','A'),
                                  ('G2','B')],names=['Group','Subgroup'])

np.random.seed(42)
data=pd.DataFrame(np.random.randn(4,4),columns=['Metric1', 'Metric2','Metric3', 'Metric4'],index=m_index)
print(data)

                 Metric1   Metric2   Metric3   Metric4
Group Subgroup
G1    A         0.496714 -0.138264  0.647689  1.523030
      B        -0.234153 -0.234137  1.579213  0.767435
G2    A        -0.469474  0.542560 -0.463418 -0.465730
      B         0.241962 -1.913280 -1.724918 -0.562288

In [51]:
# with reset

data.reset_index()

  Group Subgroup   Metric1   Metric2   Metric3   Metric4
0    G1        A  0.496714 -0.138264  0.647689  1.523030
1    G1        B -0.234153 -0.234137  1.579213  0.767435
2    G2        A -0.469474  0.542560 -0.463418 -0.465730
3    G2        B  0.241962 -1.913280 -1.724918 -0.562288

In [53]:
#1 (melt cannot hie data)
data.reset_index().melt(id_vars=['Group','Subgroup'],var_name='Metric',value_name='Value')

   Group Subgroup   Metric     Value
0     G1        A  Metric1  0.496714
1     G1        B  Metric1 -0.234153
2     G2        A  Metric1 -0.469474
3     G2        B  Metric1  0.241962
4     G1        A  Metric2 -0.138264
5     G1        B  Metric2 -0.234137
6     G2        A  Metric2  0.542560
7     G2        B  Metric2 -1.913280
8     G1        A  Metric3  0.647689
9     G1        B  Metric3  1.579213
10    G2        A  Metric3 -0.463418
11    G2        B  Metric3 -1.724918
12    G1        A  Metric4  1.523030
13    G1        B  Metric4  0.767435
14    G2        A  Metric4 -0.465730
15    G2        B  Metric4 -0.562288

In [54]:
#2
pd.melt(data.reset_index(),id_vars=['Group','Subgroup'],var_name='Metric',value_name='Value')

   Group Subgroup   Metric     Value
0     G1        A  Metric1  0.496714
1     G1        B  Metric1 -0.234153
2     G2        A  Metric1 -0.469474
3     G2        B  Metric1  0.241962
4     G1        A  Metric2 -0.138264
5     G1        B  Metric2 -0.234137
6     G2        A  Metric2  0.542560
7     G2        B  Metric2 -1.913280
8     G1        A  Metric3  0.647689
9     G1        B  Metric3  1.579213
10    G2        A  Metric3 -0.463418
11    G2        B  Metric3 -1.724918
12    G1        A  Metric4  1.523030
13    G1        B  Metric4  0.767435
14    G2        A  Metric4 -0.465730
15    G2        B  Metric4 -0.562288

In [56]:
# with stack
data.stack().reset_index()

   Group Subgroup  level_2         0
0     G1        A  Metric1  0.496714
1     G1        A  Metric2 -0.138264
2     G1        A  Metric3  0.647689
3     G1        A  Metric4  1.523030
4     G1        B  Metric1 -0.234153
5     G1        B  Metric2 -0.234137
6     G1        B  Metric3  1.579213
7     G1        B  Metric4  0.767435
8     G2        A  Metric1 -0.469474
9     G2        A  Metric2  0.542560
10    G2        A  Metric3 -0.463418
11    G2        A  Metric4 -0.465730
12    G2        B  Metric1  0.241962
13    G2        B  Metric2 -1.913280
14    G2        B  Metric3 -1.724918
15    G2        B  Metric4 -0.562288

In [57]:
long_data=data.stack()
print(long_data)

Group  Subgroup
G1     A         Metric1    0.496714
                 Metric2   -0.138264
                 Metric3    0.647689
                 Metric4    1.523030
       B         Metric1   -0.234153
                 Metric2   -0.234137
                 Metric3    1.579213
                 Metric4    0.767435
G2     A         Metric1   -0.469474
                 Metric2    0.542560
                 Metric3   -0.463418
                 Metric4   -0.465730
       B         Metric1    0.241962
                 Metric2   -1.913280
                 Metric3   -1.724918
                 Metric4   -0.562288
dtype: float64

In [58]:
long_data.unstack()

                 Metric1   Metric2   Metric3   Metric4
Group Subgroup
G1    A         0.496714 -0.138264  0.647689  1.523030
      B        -0.234153 -0.234137  1.579213  0.767435
G2    A        -0.469474  0.542560 -0.463418 -0.465730
      B         0.241962 -1.913280 -1.724918 -0.562288

In [59]:
long_data.reset_index()

   Group Subgroup  level_2         0
0     G1        A  Metric1  0.496714
1     G1        A  Metric2 -0.138264
2     G1        A  Metric3  0.647689
3     G1        A  Metric4  1.523030
4     G1        B  Metric1 -0.234153
5     G1        B  Metric2 -0.234137
6     G1        B  Metric3  1.579213
7     G1        B  Metric4  0.767435
8     G2        A  Metric1 -0.469474
9     G2        A  Metric2  0.542560
10    G2        A  Metric3 -0.463418
11    G2        A  Metric4 -0.465730
12    G2        B  Metric1  0.241962
13    G2        B  Metric2 -1.913280
14    G2        B  Metric3 -1.724918
15    G2        B  Metric4 -0.562288

In [61]:
long_data.reset_index().pivot(index=['Group','Subgroup'],columns='level_2',values=0)

level_2          Metric1   Metric2   Metric3   Metric4
Group Subgroup
G1    A         0.496714 -0.138264  0.647689  1.523030
      B        -0.234153 -0.234137  1.579213  0.767435
G2    A        -0.469474  0.542560 -0.463418 -0.465730
      B         0.241962 -1.913280 -1.724918 -0.562288

### Merging Datasets

In [62]:
# using simple data
df1=pd.DataFrame({'key':['A','B','C'], 'value1':[1,2,3]})
print(df1)
df2=pd.DataFrame({'key':['A','B','D'], 'value2':[4,5,6]})
print(df2)

  key  value1
0   A       1
1   B       2
2   C       3
  key  value2
0   A       4
1   B       5
2   D       6

In [63]:
pd.merge(df1,df2,on='key',how='outer') #all

  key  value1  value2
0   A     1.0     4.0
1   B     2.0     5.0
2   C     3.0     NaN
3   D     NaN     6.0

In [64]:
pd.merge(df1,df2,on='key',how='inner') #intersect

  key  value1  value2
0   A       1       4
1   B       2       5

In [65]:
pd.merge(df1,df2,on='key',how='left') #all left

  key  value1  value2
0   A       1     4.0
1   B       2     5.0
2   C       3     NaN

In [66]:
pd.merge(df1,df2,on='key',how='right') #all right

  key  value1  value2
0   A     1.0       4
1   B     2.0       5
2   D     NaN       6

In [68]:
df1=pd.DataFrame({'key1':['A','B','C'], 'value1':[1,2,3]})
df2=pd.DataFrame({'key2':['A','B','D'], 'value2':[4,5,6]})
pd.merge(df1,df2,left_on='key1',right_on='key2',how='inner')

  key1  value1 key2  value2
0    A       1    A       4
1    B       2    B       5

In [69]:
# using hie data
df1=pd.DataFrame({'Value1':[1,2]}, index=pd.MultiIndex.from_tuples([('A','1'),('B','2')],names=['key','subkey']))
df2=pd.DataFrame({'Value2':[3,4]}, index=pd.MultiIndex.from_tuples([('A','1'),('C','2')],names=['key','subkey']))
print(df1)
print(df2)

            Value1
key subkey
A   1            1
B   2            2
            Value2
key subkey
A   1            3
C   2            4

In [72]:
pd.merge(df1,df2,on=['key','subkey'], how='outer')

            Value1  Value2
key subkey
A   1          1.0     3.0
B   2          2.0     NaN
C   2          NaN     4.0

In [80]:
df1=pd.DataFrame({'Value1':[1,2,3]}, index=pd.MultiIndex.from_tuples([('X','A','1'),('Y','B','1'),('Y','B','2')],names=['level1','level2','level3']))
df2=pd.DataFrame({'Value2':[4,5,6]}, index=pd.MultiIndex.from_tuples([('Y','A','1'),('Y','B','2'),('Z','B','3')],names=['level1','level2','level3']))
print(df1)
print(df2)

                      Value1
level1 level2 level3
X      A      1            1
Y      B      1            2
              2            3
                      Value2
level1 level2 level3
Y      A      1            4
       B      2            5
Z      B      3            6

In [81]:
pd.merge(df1,df2,on=['level1','level2','level3'],how='outer')

                      Value1  Value2
level1 level2 level3
X      A      1          1.0     NaN
Y      B      1          2.0     NaN
              2          3.0     5.0
       A      1          NaN     4.0
Z      B      3          NaN     6.0

In [83]:
df1=pd.DataFrame({'A':[1,2],'B':[3,4]})
df2=pd.DataFrame({'A':[5,6],'B':[7,8]})
print(df1)
print(df2)

print(pd.concat([df1,df2],axis=1))

   A  B
0  1  3
1  2  4
   A  B
0  5  7
1  6  8
   A  B  A  B
0  1  3  5  7
1  2  4  6  8

In [87]:
df1=pd.DataFrame({'Value1':[1,2]}, index=pd.MultiIndex.from_tuples([('A','1'),('B','2')],names=['key','subkey']))
df2=pd.DataFrame({'Value2':[3,4]}, index=pd.MultiIndex.from_tuples([('A','1'),('C','2')],names=['key','subkey']))
print(df1)
print(df2)

print(pd.concat([df1,df2],axis=1,join='inner')) # default is join=outer

            Value1
key subkey
A   1            1
B   2            2
            Value2
key subkey
A   1            3
C   2            4
            Value1  Value2
key subkey
A   1            1       3

In [88]:
df1=pd.DataFrame({'Value1':[1,2,3]}, index=pd.MultiIndex.from_tuples([('X','A','1'),('Y','B','1'),('Y','B','2')],names=['level1','level2','level3']))
df2=pd.DataFrame({'Value2':[4,5,6]}, index=pd.MultiIndex.from_tuples([('Y','A','1'),('Y','B','2'),('Z','B','3')],names=['level1','level2','level3']))
print(df1)
print(df2)

print(pd.concat([df1,df2],axis=1))

                      Value1
level1 level2 level3
X      A      1            1
Y      B      1            2
              2            3
                      Value2
level1 level2 level3
Y      A      1            4
       B      2            5
Z      B      3            6
                      Value1  Value2
level1 level2 level3
X      A      1          1.0     NaN
Y      B      1          2.0     NaN
              2          3.0     5.0
       A      1          NaN     4.0
Z      B      3          NaN     6.0

In [120]:
emp1=pd.read_csv('emp1.csv', skiprows=1)
print(emp1)
emp2=pd.read_csv('emp2.csv', skiprows=2)
print(emp2)

      id  grade    status        type first name  last name  salary
0  10212     41    active   permanent        ali      smith    2200
1  10213     41    active   permanent       john        doe    2300
2  10214     44    active   permanent     sheryl  armstrong    3600
3  10215     42    active   permanent      haily     bailey    2500
4  10216     48    active    contract    jackson      green    5200
5  10217     54    active   permanent     martin     parker    5200
6  10218     41  inactive   contract        rose     taylor    2600
7  10219     52    active    contract     wilson       wood    6600
8  10220     42    active   permanent   mitchell        lee    2500
      id  grade    status        type            name  salary
0  10221     41    active   permanent  lawrence lloyd    2420
1  10222     41  inactive   permanent     james moore    2530
2  10223     44    active   permanent   amelia phills    3960
3  10224     42    active   permanent     sally price    2750
4  10225     48    active    contract   amanda taylor    5720
5  10226     54    active   permanent    robert scort    5720
6  10227     41    active   contract      rose taylor    2860
7  10228     52    active    contract     thomas will    7260
8  10229     42    active   permanent    nicole white    2750

In [97]:
emp1.columns

Index(['id', 'grade', 'status', 'type', 'first name', 'last name', 'salary'], dtype='object')

In [121]:
#rename column salary
emp1=emp1.rename(columns={emp1.columns[6]:'salary(MYR)'})
print(emp1)

      id  grade    status        type first name  last name  salary(MYR)
0  10212     41    active   permanent        ali      smith         2200
1  10213     41    active   permanent       john        doe         2300
2  10214     44    active   permanent     sheryl  armstrong         3600
3  10215     42    active   permanent      haily     bailey         2500
4  10216     48    active    contract    jackson      green         5200
5  10217     54    active   permanent     martin     parker         5200
6  10218     41  inactive   contract        rose     taylor         2600
7  10219     52    active    contract     wilson       wood         6600
8  10220     42    active   permanent   mitchell        lee         2500

In [100]:
emp2.columns

Index(['id', 'grade', 'status', 'type', 'name', 'salary'], dtype='object')

In [122]:
emp2=emp2.rename(columns={emp2.columns[5]:'salary(USD)'})
print(emp2)

      id  grade    status        type            name  salary(USD)
0  10221     41    active   permanent  lawrence lloyd         2420
1  10222     41  inactive   permanent     james moore         2530
2  10223     44    active   permanent   amelia phills         3960
3  10224     42    active   permanent     sally price         2750
4  10225     48    active    contract   amanda taylor         5720
5  10226     54    active   permanent    robert scort         5720
6  10227     41    active   contract      rose taylor         2860
7  10228     52    active    contract     thomas will         7260
8  10229     42    active   permanent    nicole white         2750

In [123]:
#remove whitespace to all using map
emp1=emp1.map(lambda x: x.strip() if isinstance(x,str) else x)
print(emp1)

      id  grade    status       type first name  last name  salary(MYR)
0  10212     41    active  permanent        ali      smith         2200
1  10213     41    active  permanent       john        doe         2300
2  10214     44    active  permanent     sheryl  armstrong         3600
3  10215     42    active  permanent      haily     bailey         2500
4  10216     48    active   contract    jackson      green         5200
5  10217     54    active  permanent     martin     parker         5200
6  10218     41  inactive   contract       rose     taylor         2600
7  10219     52    active   contract     wilson       wood         6600
8  10220     42    active  permanent   mitchell        lee         2500

In [124]:
emp2=emp2.map(lambda x: x.strip() if isinstance(x,str) else x)
print(emp2)

      id  grade    status       type            name  salary(USD)
0  10221     41    active  permanent  lawrence lloyd         2420
1  10222     41  inactive  permanent     james moore         2530
2  10223     44    active  permanent   amelia phills         3960
3  10224     42    active  permanent     sally price         2750
4  10225     48    active   contract   amanda taylor         5720
5  10226     54    active  permanent    robert scort         5720
6  10227     41    active   contract     rose taylor         2860
7  10228     52    active   contract     thomas will         7260
8  10229     42    active  permanent    nicole white         2750

In [125]:
#combine column first name and last name
emp1['name']=emp1['first name']+' '+ ['last name']
print(emp1)

      id  grade    status       type first name  last name  salary(MYR)  \
0  10212     41    active  permanent        ali      smith         2200
1  10213     41    active  permanent       john        doe         2300
2  10214     44    active  permanent     sheryl  armstrong         3600
3  10215     42    active  permanent      haily     bailey         2500
4  10216     48    active   contract    jackson      green         5200
5  10217     54    active  permanent     martin     parker         5200
6  10218     41  inactive   contract       rose     taylor         2600
7  10219     52    active   contract     wilson       wood         6600
8  10220     42    active  permanent   mitchell        lee         2500

                 name
0       ali last name
1      john last name
2    sheryl last name
3     haily last name
4   jackson last name
5    martin last name
6      rose last name
7    wilson last name
8  mitchell last name

In [127]:
#drop column first name and last name
emp1=emp1.drop(columns=['first name','last name'])
print(emp1)

#or
#emp1.drop(columns=['first name','last name'],inplace=True)
#print(emp1)

      id  grade    status       type  salary(MYR)                name
0  10212     41    active  permanent         2200       ali last name
1  10213     41    active  permanent         2300      john last name
2  10214     44    active  permanent         3600    sheryl last name
3  10215     42    active  permanent         2500     haily last name
4  10216     48    active   contract         5200   jackson last name
5  10217     54    active  permanent         5200    martin last name
6  10218     41  inactive   contract         2600      rose last name
7  10219     52    active   contract         6600    wilson last name
8  10220     42    active  permanent         2500  mitchell last name

In [128]:
joindata=pd.merge(emp1,emp2, how='outer')
joindata.head()

,id,grade,status,type,salary(MYR),name,salary(USD)
0,10212,41,active,permanent,2200.0,ali last name,NaN
1,10213,41,active,permanent,2300.0,john last name,NaN
2,10214,44,active,permanent,3600.0,sheryl last name,NaN
3,10215,42,active,permanent,2500.0,haily last name,NaN
4,10216,48,active,contract,5200.0,jackson last name,NaN

In [129]:
joindata['status']=='active'

0      True
1      True
2      True
3      True
4      True
5      True
6     False
7      True
8      True
9      True
10    False
11     True
12     True
13     True
14     True
15     True
16     True
17     True
Name: status, dtype: bool

In [130]:
joindata[joindata['status']=='active'].reset_index()

,index,id,grade,status,type,salary(MYR),name,salary(USD)
0,0,10212,41,active,permanent,2200.0,ali last name,NaN
1,1,10213,41,active,permanent,2300.0,john last name,NaN
2,2,10214,44,active,permanent,3600.0,sheryl last name,NaN
3,3,10215,42,active,permanent,2500.0,haily last name,NaN
4,4,10216,48,active,contract,5200.0,jackson last name,NaN
5,5,10217,54,active,permanent,5200.0,martin last name,NaN
6,7,10219,52,active,contract,6600.0,wilson last name,NaN
7,8,10220,42,active,permanent,2500.0,mitchell last name,NaN
8,9,10221,41,active,permanent,NaN,lawrence lloyd,2420.0
9,11,10223,44,active,permanent,NaN,amelia phills,3960.0
10,12,10224,42,active,permanent,NaN,sally price,2750.0
11,13,10225,48,active,contract,NaN,amanda taylor,5720.0
12,14,10226,54,active,permanent,NaN,robert scort,5720.0
13,15,10227,41,active,contract,NaN,rose taylor,2860.0
14,16,10228,52,active,contract,NaN,thomas will,7260.0
15,17,10229,42,active,permanent,NaN,nicole white,2750.0

In [136]:
#1. fifth largest salary in MYR in form of number(using sort). hint:2750.0 

#using index
q1=joindata['salary(MYR)'].sort_values(ascending=False).reset_index()
q1['salary(MYR)'][4]

#using iloc
#q1=joindata['salary(MYR)'].sort_values(ascending=False).iloc[4]

2600.0

In [140]:
#2. who has the highest salary in USD in form of strring. hint:nicole white
q2=joindata['salary(USD)'].idxmax()
print(q2)

16    7260.0
13    5720.0
14    5720.0
11    3960.0
15    2860.0
12    2750.0
17    2750.0
10    2530.0
9     2420.0
0        NaN
1        NaN
2        NaN
3        NaN
4        NaN
5        NaN
6        NaN
7        NaN
8        NaN
Name: salary(USD), dtype: float64

In [143]:
joindata.loc[joindata['salary(USD)'].idxmax(),'name']

'thomas will'